testing/share/Testing/test_data/SimpleDynamic_4/fluid/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    fsiFace
    {
        type            fixedValue; //movingWallVelocity;
        value           uniform (0 0 0);
    }

    top
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    right
    {
        type            zeroGradient;
    }

    left
    {
        type            transitionalParabolicVelocity;
        maxValue        1.5;
        n               ( 0 0 1 );
        y               ( 0 1 0 );
        transitionPeriod 0.1;
        boundBoxMin     ( 0.0 0.01 0.0 );
        boundBoxMax     ( 0.1 0.91 0.0 );
        value           uniform (0 0 0);
    }

    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }
}

// ************************************************************************* //
