testing/share/Testing/test_data/SimpleDynamic_4/fluid/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0.1 0.01 0.0)     // 0
    (0.1 0.01 1.0)     // 1
    (0.1 0.91 1.0)     // 2
    (0.1 0.91 0.0)     // 3

    (0.0 0.01 0.0)     // 4
    (0.0 0.01 1.0)     // 5
    (0.0 0.91 1.0)     // 6
    (0.0 0.91 0.0)     // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (100 100 1) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    wall left
    (
        (0 3 7 4)
    )
    wall right
    (
        (1 5 6 2)
    )
    wall fsiFace
    (
        (0 4 5 1)
    )
    wall top
    (
        (3 2 6 7)
    )
    empty front
    (
        (4 7 6 5)
    )
    empty back
    (
        (0 1 2 3)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
