testing/share/Testing/test_data/SimpleDynamic_4/fluid/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


6
(
left
{
    type            wall;
    nFaces          100;
    startFace       19800;
}

right
{
    type            wall;
    nFaces          100;
    startFace       19900;
}

fsiFace
{
    type            wall;
    nFaces          100;
    startFace       20000;
}

top
{
    type            wall;
    nFaces          100;
    startFace       20100;
}

front
{
    type            empty;
    nFaces          10000;
    startFace       20200;
}

back
{
    type            empty;
    nFaces          10000;
    startFace       30200;
}

)


// ************************************************************************* //
